MikroElektronika/core_packages/RX/gcc/def/renesas/R5F526TBDGFL/mcu.h
typedef struct st_rsci8 {
	union {
		unsigned long LONG;
		struct {
			unsigned short L;
			unsigned short H;
		} WORD;
		struct {
			unsigned char LL;
			unsigned char LH;
			unsigned char HL;
			unsigned char HH;
		} BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long RDAT : 9;
			unsigned long MPB : 1;
			unsigned long DR : 1;
			unsigned long PER : 1;
			unsigned long FER : 1;
			unsigned long  : 11;
			unsigned long ORER : 1;
			unsigned long  : 2;
			unsigned long APER : 1;
			unsigned long AFER : 1;
			unsigned long  : 3;
#else
			unsigned long  : 3;
			unsigned long AFER : 1;
			unsigned long APER : 1;
			unsigned long  : 2;
			unsigned long ORER : 1;
			unsigned long  : 11;
			unsigned long FER : 1;
			unsigned long PER : 1;
			unsigned long DR : 1;
			unsigned long MPB : 1;
			unsigned long RDAT : 9;
#endif
	} BIT;
	} RDR;
	union {
		unsigned long LONG;
		struct {
			unsigned short L;
			unsigned short H;
		} WORD;
		struct {
			unsigned char LL;
			unsigned char LH;
			unsigned char HL;
			unsigned char HH;
		} BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long TDAT : 9;
			unsigned long MPBT : 1;
			unsigned long  : 2;
			unsigned long SYNC : 1;
			unsigned long  : 19;
#else
			unsigned long  : 19;
			unsigned long SYNC : 1;
			unsigned long  : 2;
			unsigned long MPBT : 1;
			unsigned long TDAT : 9;
#endif
	} BIT;
	} TDR;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long RE : 1;
			unsigned long  : 3;
			unsigned long TE : 1;
			unsigned long  : 3;
			unsigned long MPIE : 1;
			unsigned long DCME : 1;
			unsigned long IDSEL : 1;
			unsigned long  : 5;
			unsigned long RIE : 1;
			unsigned long  : 3;
			unsigned long TIE : 1;
			unsigned long TEIE : 1;
			unsigned long  : 2;
			unsigned long SSE : 1;
			unsigned long  : 7;
#else
			unsigned long  : 7;
			unsigned long SSE : 1;
			unsigned long  : 2;
			unsigned long TEIE : 1;
			unsigned long TIE : 1;
			unsigned long  : 3;
			unsigned long RIE : 1;
			unsigned long  : 5;
			unsigned long IDSEL : 1;
			unsigned long DCME : 1;
			unsigned long MPIE : 1;
			unsigned long  : 3;
			unsigned long TE : 1;
			unsigned long  : 3;
			unsigned long RE : 1;
#endif
	} BIT;
	} SCR0;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long CTSE : 1;
			unsigned long CRSEP : 1;
			unsigned long  : 2;
			unsigned long SPB2DT : 1;
			unsigned long SPB2IO : 1;
			unsigned long  : 2;
			unsigned long PE : 1;
			unsigned long PM : 1;
			unsigned long  : 2;
			unsigned long TINV : 1;
			unsigned long RINV : 1;
			unsigned long  : 2;
			unsigned long LOOP : 1;
			unsigned long  : 3;
			unsigned long HDSEL : 1;
			unsigned long  : 3;
			unsigned long NFCS : 3;
			unsigned long  : 1;
			unsigned long NFEN : 1;
			unsigned long  : 3;
#else
			unsigned long  : 3;
			unsigned long NFEN : 1;
			unsigned long  : 1;
			unsigned long NFCS : 3;
			unsigned long  : 3;
			unsigned long HDSEL : 1;
			unsigned long  : 3;
			unsigned long LOOP : 1;
			unsigned long  : 2;
			unsigned long RINV : 1;
			unsigned long TINV : 1;
			unsigned long  : 2;
			unsigned long PM : 1;
			unsigned long PE : 1;
			unsigned long  : 2;
			unsigned long SPB2IO : 1;
			unsigned long SPB2DT : 1;
			unsigned long  : 2;
			unsigned long CRSEP : 1;
			unsigned long CTSE : 1;
#endif
	} BIT;
	} SCR1;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long BCP : 3;
			unsigned long  : 1;
			unsigned long BGDM : 1;
			unsigned long ABCS : 1;
			unsigned long ABCSE : 1;
			unsigned long  : 1;
			unsigned long BRR : 8;
			unsigned long BRME : 1;
			unsigned long  : 3;
			unsigned long CKS : 2;
			unsigned long  : 2;
			unsigned long MDDR : 8;
#else
			unsigned long MDDR : 8;
			unsigned long  : 2;
			unsigned long CKS : 2;
			unsigned long  : 3;
			unsigned long BRME : 1;
			unsigned long BRR : 8;
			unsigned long  : 1;
			unsigned long ABCSE : 1;
			unsigned long ABCS : 1;
			unsigned long BGDM : 1;
			unsigned long  : 1;
			unsigned long BCP : 3;
#endif
	} BIT;
	} SCR2;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long CPHA : 1;
			unsigned long CPOL : 1;
			unsigned long  : 5;
			unsigned long SYNDIS : 1;
			unsigned long CHR : 2;
			unsigned long  : 2;
			unsigned long DDIR : 1;
			unsigned long DINV : 1;
			unsigned long STOP : 1;
			unsigned long RXDESEL : 1;
			unsigned long MOD : 3;
			unsigned long MP : 1;
			unsigned long FM : 1;
			unsigned long DEEN : 1;
			unsigned long  : 2;
			unsigned long CKE : 2;
			unsigned long  : 2;
			unsigned long GM : 1;
			unsigned long BLK : 1;
			unsigned long  : 2;
#else
			unsigned long  : 2;
			unsigned long BLK : 1;
			unsigned long GM : 1;
			unsigned long  : 2;
			unsigned long CKE : 2;
			unsigned long  : 2;
			unsigned long DEEN : 1;
			unsigned long FM : 1;
			unsigned long MP : 1;
			unsigned long MOD : 3;
			unsigned long RXDESEL : 1;
			unsigned long STOP : 1;
			unsigned long DINV : 1;
			unsigned long DDIR : 1;
			unsigned long  : 2;
			unsigned long CHR : 2;
			unsigned long SYNDIS : 1;
			unsigned long  : 5;
			unsigned long CPOL : 1;
			unsigned long CPHA : 1;
#endif
	} BIT;
	} SCR3;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long CMPD : 9;
			unsigned long  : 7;
			unsigned long RTADJ : 1;
			unsigned long TTADJ : 1;
			unsigned long  : 6;
			unsigned long RTMG : 4;
			unsigned long TTMG : 4;
#else
			unsigned long TTMG : 4;
			unsigned long RTMG : 4;
			unsigned long  : 6;
			unsigned long TTADJ : 1;
			unsigned long RTADJ : 1;
			unsigned long  : 7;
			unsigned long CMPD : 9;
#endif
	} BIT;
	} SCR4;
	char           wk0[2];
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char HBSE : 1;
			unsigned char  : 1;
			unsigned char AOE : 1;
			unsigned char LPS : 1;
			unsigned char  : 4;
#else
			unsigned char  : 4;
			unsigned char LPS : 1;
			unsigned char AOE : 1;
			unsigned char  : 1;
			unsigned char HBSE : 1;
#endif
	} BIT;
	} HBSCR;
	char           wk1[1];
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long IICDL : 5;
			unsigned long  : 3;
			unsigned long IICINTM : 1;
			unsigned long IICCSC : 1;
			unsigned long  : 3;
			unsigned long IICACKT : 1;
			unsigned long  : 2;
			unsigned long IICSTAREQ : 1;
			unsigned long IICRSTAREQ : 1;
			unsigned long IICSTPREQ : 1;
			unsigned long  : 1;
			unsigned long IICSDAS : 2;
			unsigned long IICSCLS : 2;
			unsigned long  : 8;
#else
			unsigned long  : 8;
			unsigned long IICSCLS : 2;
			unsigned long IICSDAS : 2;
			unsigned long  : 1;
			unsigned long IICSTPREQ : 1;
			unsigned long IICRSTAREQ : 1;
			unsigned long IICSTAREQ : 1;
			unsigned long  : 2;
			unsigned long IICACKT : 1;
			unsigned long  : 3;
			unsigned long IICCSC : 1;
			unsigned long IICINTM : 1;
			unsigned long  : 3;
			unsigned long IICDL : 5;
#endif
	} BIT;
	} SIMR;
	char           wk2[12];
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long DELVL : 1;
			unsigned long  : 7;
			unsigned long DESU : 5;
			unsigned long  : 3;
			unsigned long DEHLD : 5;
			unsigned long  : 11;
#else
			unsigned long  : 11;
			unsigned long DEHLD : 5;
			unsigned long  : 3;
			unsigned long DESU : 5;
			unsigned long  : 7;
			unsigned long DELVL : 1;
#endif
	} BIT;
	} DECR;
	char           wk3[20];
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long  : 4;
			unsigned long ERS : 1;
			unsigned long  : 10;
			unsigned long RXDMON : 1;
			unsigned long DCMF : 1;
			unsigned long DPER : 1;
			unsigned long DFER : 1;
			unsigned long  : 5;
			unsigned long ORER : 1;
			unsigned long  : 1;
			unsigned long MFF : 1;
			unsigned long APER : 1;
			unsigned long AFER : 1;
			unsigned long TDRE : 1;
			unsigned long TEND : 1;
			unsigned long RDRF : 1;
#else
			unsigned long RDRF : 1;
			unsigned long TEND : 1;
			unsigned long TDRE : 1;
			unsigned long AFER : 1;
			unsigned long APER : 1;
			unsigned long MFF : 1;
			unsigned long  : 1;
			unsigned long ORER : 1;
			unsigned long  : 5;
			unsigned long DFER : 1;
			unsigned long DPER : 1;
			unsigned long DCMF : 1;
			unsigned long RXDMON : 1;
			unsigned long  : 10;
			unsigned long ERS : 1;
			unsigned long  : 4;
#endif
	} BIT;
	} SSR;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long IICACKR : 1;
			unsigned long  : 2;
			unsigned long IICSTIF : 1;
			unsigned long  : 28;
#else
			unsigned long  : 28;
			unsigned long IICSTIF : 1;
			unsigned long  : 2;
			unsigned long IICACKR : 1;
#endif
	} BIT;
	} SISR;
	char           wk4[24];
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long  : 4;
			unsigned long ERSC : 1;
			unsigned long  : 11;
			unsigned long DCMFC : 1;
			unsigned long DPERC : 1;
			unsigned long DFERC : 1;
			unsigned long  : 5;
			unsigned long ORERC : 1;
			unsigned long  : 1;
			unsigned long MFFC : 1;
			unsigned long APERC : 1;
			unsigned long AFERC : 1;
			unsigned long TDREC : 1;
			unsigned long  : 1;
			unsigned long RDRFC : 1;
#else
			unsigned long RDRFC : 1;
			unsigned long  : 1;
			unsigned long TDREC : 1;
			unsigned long AFERC : 1;
			unsigned long APERC : 1;
			unsigned long MFFC : 1;
			unsigned long  : 1;
			unsigned long ORERC : 1;
			unsigned long  : 5;
			unsigned long DFERC : 1;
			unsigned long DPERC : 1;
			unsigned long DCMFC : 1;
			unsigned long  : 11;
			unsigned long ERSC : 1;
			unsigned long  : 4;
#endif
	} BIT;
	} SSCR;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long  : 3;
			unsigned long IICSTIFC : 1;
			unsigned long  : 28;
#else
			unsigned long  : 28;
			unsigned long IICSTIFC : 1;
			unsigned long  : 3;
#endif
	} BIT;
	} SISCR;
} st_rsci8_t;

typedef struct st_rsci9 {
	union {
		unsigned long LONG;
		struct {
			unsigned short L;
			unsigned short H;
		} WORD;
		struct {
			unsigned char LL;
			unsigned char LH;
			unsigned char HL;
			unsigned char HH;
		} BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long RDAT : 9;
			unsigned long MPB : 1;
			unsigned long DR : 1;
			unsigned long PER : 1;
			unsigned long FER : 1;
			unsigned long  : 11;
			unsigned long ORER : 1;
			unsigned long  : 2;
			unsigned long APER : 1;
			unsigned long AFER : 1;
			unsigned long  : 3;
#else
			unsigned long  : 3;
			unsigned long AFER : 1;
			unsigned long APER : 1;
			unsigned long  : 2;
			unsigned long ORER : 1;
			unsigned long  : 11;
			unsigned long FER : 1;
			unsigned long PER : 1;
			unsigned long DR : 1;
			unsigned long MPB : 1;
			unsigned long RDAT : 9;
#endif
	} BIT;
	} RDR;
	union {
		unsigned long LONG;
		struct {
			unsigned short L;
			unsigned short H;
		} WORD;
		struct {
			unsigned char LL;
			unsigned char LH;
			unsigned char HL;
			unsigned char HH;
		} BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long TDAT : 9;
			unsigned long MPBT : 1;
			unsigned long  : 2;
			unsigned long SYNC : 1;
			unsigned long  : 19;
#else
			unsigned long  : 19;
			unsigned long SYNC : 1;
			unsigned long  : 2;
			unsigned long MPBT : 1;
			unsigned long TDAT : 9;
#endif
	} BIT;
	} TDR;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long RE : 1;
			unsigned long  : 3;
			unsigned long TE : 1;
			unsigned long  : 3;
			unsigned long MPIE : 1;
			unsigned long DCME : 1;
			unsigned long IDSEL : 1;
			unsigned long  : 5;
			unsigned long RIE : 1;
			unsigned long  : 3;
			unsigned long TIE : 1;
			unsigned long TEIE : 1;
			unsigned long  : 2;
			unsigned long SSE : 1;
			unsigned long  : 7;
#else
			unsigned long  : 7;
			unsigned long SSE : 1;
			unsigned long  : 2;
			unsigned long TEIE : 1;
			unsigned long TIE : 1;
			unsigned long  : 3;
			unsigned long RIE : 1;
			unsigned long  : 5;
			unsigned long IDSEL : 1;
			unsigned long DCME : 1;
			unsigned long MPIE : 1;
			unsigned long  : 3;
			unsigned long TE : 1;
			unsigned long  : 3;
			unsigned long RE : 1;
#endif
	} BIT;
	} SCR0;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long CTSE : 1;
			unsigned long CRSEP : 1;
			unsigned long  : 2;
			unsigned long SPB2DT : 1;
			unsigned long SPB2IO : 1;
			unsigned long  : 2;
			unsigned long PE : 1;
			unsigned long PM : 1;
			unsigned long  : 2;
			unsigned long TINV : 1;
			unsigned long RINV : 1;
			unsigned long  : 2;
			unsigned long LOOP : 1;
			unsigned long  : 3;
			unsigned long HDSEL : 1;
			unsigned long  : 3;
			unsigned long NFCS : 3;
			unsigned long  : 1;
			unsigned long NFEN : 1;
			unsigned long  : 3;
#else
			unsigned long  : 3;
			unsigned long NFEN : 1;
			unsigned long  : 1;
			unsigned long NFCS : 3;
			unsigned long  : 3;
			unsigned long HDSEL : 1;
			unsigned long  : 3;
			unsigned long LOOP : 1;
			unsigned long  : 2;
			unsigned long RINV : 1;
			unsigned long TINV : 1;
			unsigned long  : 2;
			unsigned long PM : 1;
			unsigned long PE : 1;
			unsigned long  : 2;
			unsigned long SPB2IO : 1;
			unsigned long SPB2DT : 1;
			unsigned long  : 2;
			unsigned long CRSEP : 1;
			unsigned long CTSE : 1;
#endif
	} BIT;
	} SCR1;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long BCP : 3;
			unsigned long  : 1;
			unsigned long BGDM : 1;
			unsigned long ABCS : 1;
			unsigned long ABCSE : 1;
			unsigned long  : 1;
			unsigned long BRR : 8;
			unsigned long BRME : 1;
			unsigned long  : 3;
			unsigned long CKS : 2;
			unsigned long  : 2;
			unsigned long MDDR : 8;
#else
			unsigned long MDDR : 8;
			unsigned long  : 2;
			unsigned long CKS : 2;
			unsigned long  : 3;
			unsigned long BRME : 1;
			unsigned long BRR : 8;
			unsigned long  : 1;
			unsigned long ABCSE : 1;
			unsigned long ABCS : 1;
			unsigned long BGDM : 1;
			unsigned long  : 1;
			unsigned long BCP : 3;
#endif
	} BIT;
	} SCR2;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long CPHA : 1;
			unsigned long CPOL : 1;
			unsigned long  : 5;
			unsigned long SYNDIS : 1;
			unsigned long CHR : 2;
			unsigned long  : 2;
			unsigned long DDIR : 1;
			unsigned long DINV : 1;
			unsigned long STOP : 1;
			unsigned long RXDESEL : 1;
			unsigned long MOD : 3;
			unsigned long MP : 1;
			unsigned long FM : 1;
			unsigned long DEEN : 1;
			unsigned long  : 2;
			unsigned long CKE : 2;
			unsigned long  : 2;
			unsigned long GM : 1;
			unsigned long BLK : 1;
			unsigned long  : 2;
#else
			unsigned long  : 2;
			unsigned long BLK : 1;
			unsigned long GM : 1;
			unsigned long  : 2;
			unsigned long CKE : 2;
			unsigned long  : 2;
			unsigned long DEEN : 1;
			unsigned long FM : 1;
			unsigned long MP : 1;
			unsigned long MOD : 3;
			unsigned long RXDESEL : 1;
			unsigned long STOP : 1;
			unsigned long DINV : 1;
			unsigned long DDIR : 1;
			unsigned long  : 2;
			unsigned long CHR : 2;
			unsigned long SYNDIS : 1;
			unsigned long  : 5;
			unsigned long CPOL : 1;
			unsigned long CPHA : 1;
#endif
	} BIT;
	} SCR3;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long CMPD : 9;
			unsigned long  : 7;
			unsigned long RTADJ : 1;
			unsigned long TTADJ : 1;
			unsigned long  : 6;
			unsigned long RTMG : 4;
			unsigned long TTMG : 4;
#else
			unsigned long TTMG : 4;
			unsigned long RTMG : 4;
			unsigned long  : 6;
			unsigned long TTADJ : 1;
			unsigned long RTADJ : 1;
			unsigned long  : 7;
			unsigned long CMPD : 9;
#endif
	} BIT;
	} SCR4;
	char           wk0[2];
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char HBSE : 1;
			unsigned char  : 1;
			unsigned char AOE : 1;
			unsigned char LPS : 1;
			unsigned char  : 4;
#else
			unsigned char  : 4;
			unsigned char LPS : 1;
			unsigned char AOE : 1;
			unsigned char  : 1;
			unsigned char HBSE : 1;
#endif
	} BIT;
	} HBSCR;
	char           wk1[1];
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long IICDL : 5;
			unsigned long  : 3;
			unsigned long IICINTM : 1;
			unsigned long IICCSC : 1;
			unsigned long  : 3;
			unsigned long IICACKT : 1;
			unsigned long  : 2;
			unsigned long IICSTAREQ : 1;
			unsigned long IICRSTAREQ : 1;
			unsigned long IICSTPREQ : 1;
			unsigned long  : 1;
			unsigned long IICSDAS : 2;
			unsigned long IICSCLS : 2;
			unsigned long  : 8;
#else
			unsigned long  : 8;
			unsigned long IICSCLS : 2;
			unsigned long IICSDAS : 2;
			unsigned long  : 1;
			unsigned long IICSTPREQ : 1;
			unsigned long IICRSTAREQ : 1;
			unsigned long IICSTAREQ : 1;
			unsigned long  : 2;
			unsigned long IICACKT : 1;
			unsigned long  : 3;
			unsigned long IICCSC : 1;
			unsigned long IICINTM : 1;
			unsigned long  : 3;
			unsigned long IICDL : 5;
#endif
	} BIT;
	} SIMR;
	char           wk2[8];
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long DECS : 1;
			unsigned long ENCS : 1;
			unsigned long SADJE : 1;
			unsigned long  : 1;
			unsigned long SBPTN : 1;
			unsigned long SYNCE : 1;
			unsigned long SBLEN : 1;
			unsigned long  : 1;
			unsigned long TPLEN : 4;
			unsigned long TPPAT : 2;
			unsigned long  : 2;
			unsigned long RPLEN : 4;
			unsigned long RPPAT : 2;
			unsigned long  : 2;
			unsigned long PFERIE : 1;
			unsigned long SYERIE : 1;
			unsigned long SBERIE : 1;
			unsigned long  : 5;
#else
			unsigned long  : 5;
			unsigned long SBERIE : 1;
			unsigned long SYERIE : 1;
			unsigned long PFERIE : 1;
			unsigned long  : 2;
			unsigned long RPPAT : 2;
			unsigned long RPLEN : 4;
			unsigned long  : 2;
			unsigned long TPPAT : 2;
			unsigned long TPLEN : 4;
			unsigned long  : 1;
			unsigned long SBLEN : 1;
			unsigned long SYNCE : 1;
			unsigned long SBPTN : 1;
			unsigned long  : 1;
			unsigned long SADJE : 1;
			unsigned long ENCS : 1;
			unsigned long DECS : 1;
#endif
	} BIT;
	} MMCR;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long DELVL : 1;
			unsigned long  : 7;
			unsigned long DESU : 5;
			unsigned long  : 3;
			unsigned long DEHLD : 5;
			unsigned long  : 11;
#else
			unsigned long  : 11;
			unsigned long DEHLD : 5;
			unsigned long  : 3;
			unsigned long DESU : 5;
			unsigned long  : 7;
			unsigned long DELVL : 1;
#endif
	} BIT;
	} DECR;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long TCSS : 2;
			unsigned long  : 6;
			unsigned long BFE : 1;
			unsigned long CF0RE : 1;
			unsigned long CF1DS : 2;
			unsigned long PIBE : 1;
			unsigned long PIBS : 3;
			unsigned long BFOIE : 1;
			unsigned long BCDIE : 1;
			unsigned long  : 2;
			unsigned long BFDIE : 1;
			unsigned long COFIE : 1;
			unsigned long AEDIE : 1;
			unsigned long  : 1;
			unsigned long BCCS : 2;
			unsigned long  : 6;
#else
			unsigned long  : 6;
			unsigned long BCCS : 2;
			unsigned long  : 1;
			unsigned long AEDIE : 1;
			unsigned long COFIE : 1;
			unsigned long BFDIE : 1;
			unsigned long  : 2;
			unsigned long BCDIE : 1;
			unsigned long BFOIE : 1;
			unsigned long PIBS : 3;
			unsigned long PIBE : 1;
			unsigned long CF1DS : 2;
			unsigned long CF0RE : 1;
			unsigned long BFE : 1;
			unsigned long  : 6;
			unsigned long TCSS : 2;
#endif
	} BIT;
	} XCR0;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long TCST : 1;
			unsigned long  : 3;
			unsigned long SDST : 1;
			unsigned long BRME : 1;
			unsigned long  : 2;
			unsigned long PCF1D : 8;
			unsigned long SCF1D : 8;
			unsigned long CF1CE : 8;
#else
			unsigned long CF1CE : 8;
			unsigned long SCF1D : 8;
			unsigned long PCF1D : 8;
			unsigned long  : 2;
			unsigned long BRME : 1;
			unsigned long SDST : 1;
			unsigned long  : 3;
			unsigned long TCST : 1;
#endif
	} BIT;
	} XCR1;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long CF0D : 8;
			unsigned long CF0CE : 8;
			unsigned long BFLW : 16;
#else
			unsigned long BFLW : 16;
			unsigned long CF0CE : 8;
			unsigned long CF0D : 8;
#endif
	} BIT;
	} XCR2;
	char           wk3[8];
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long  : 4;
			unsigned long ERS : 1;
			unsigned long  : 10;
			unsigned long RXDMON : 1;
			unsigned long DCMF : 1;
			unsigned long DPER : 1;
			unsigned long DFER : 1;
			unsigned long  : 5;
			unsigned long ORER : 1;
			unsigned long  : 1;
			unsigned long MFF : 1;
			unsigned long APER : 1;
			unsigned long AFER : 1;
			unsigned long TDRE : 1;
			unsigned long TEND : 1;
			unsigned long RDRF : 1;
#else
			unsigned long RDRF : 1;
			unsigned long TEND : 1;
			unsigned long TDRE : 1;
			unsigned long AFER : 1;
			unsigned long APER : 1;
			unsigned long MFF : 1;
			unsigned long  : 1;
			unsigned long ORER : 1;
			unsigned long  : 5;
			unsigned long DFER : 1;
			unsigned long DPER : 1;
			unsigned long DCMF : 1;
			unsigned long RXDMON : 1;
			unsigned long  : 10;
			unsigned long ERS : 1;
			unsigned long  : 4;
#endif
	} BIT;
	} SSR;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long IICACKR : 1;
			unsigned long  : 2;
			unsigned long IICSTIF : 1;
			unsigned long  : 28;
#else
			unsigned long  : 28;
			unsigned long IICSTIF : 1;
			unsigned long  : 2;
			unsigned long IICACKR : 1;
#endif
	} BIT;
	} SISR;
	char           wk4[8];
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long PFER : 1;
			unsigned long SYER : 1;
			unsigned long SBER : 1;
			unsigned long  : 1;
			unsigned long MCER : 1;
			unsigned long  : 1;
			unsigned long RSYNC : 1;
			unsigned long  : 25;
#else
			unsigned long  : 25;
			unsigned long RSYNC : 1;
			unsigned long  : 1;
			unsigned long MCER : 1;
			unsigned long  : 1;
			unsigned long SBER : 1;
			unsigned long SYER : 1;
			unsigned long PFER : 1;
#endif
	} BIT;
	} MMSR;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long SFSF : 1;
			unsigned long RXDSF : 1;
			unsigned long  : 6;
			unsigned long BFOF : 1;
			unsigned long BCDF : 1;
			unsigned long BFDF : 1;
			unsigned long CF0MF : 1;
			unsigned long CF1MF : 1;
			unsigned long PIBDF : 1;
			unsigned long COF : 1;
			unsigned long AEDF : 1;
			unsigned long CF0RD : 8;
			unsigned long CF1RD : 8;
#else
			unsigned long CF1RD : 8;
			unsigned long CF0RD : 8;
			unsigned long AEDF : 1;
			unsigned long COF : 1;
			unsigned long PIBDF : 1;
			unsigned long CF1MF : 1;
			unsigned long CF0MF : 1;
			unsigned long BFDF : 1;
			unsigned long BCDF : 1;
			unsigned long BFOF : 1;
			unsigned long  : 6;
			unsigned long RXDSF : 1;
			unsigned long SFSF : 1;
#endif
	} BIT;
	} XSR0;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long CCV : 16;
			unsigned long  : 16;
#else
			unsigned long  : 16;
			unsigned long CCV : 16;
#endif
	} BIT;
	} XSR1;
	char           wk5[4];
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long  : 4;
			unsigned long ERSC : 1;
			unsigned long  : 11;
			unsigned long DCMFC : 1;
			unsigned long DPERC : 1;
			unsigned long DFERC : 1;
			unsigned long  : 5;
			unsigned long ORERC : 1;
			unsigned long  : 1;
			unsigned long MFFC : 1;
			unsigned long APERC : 1;
			unsigned long AFERC : 1;
			unsigned long TDREC : 1;
			unsigned long  : 1;
			unsigned long RDRFC : 1;
#else
			unsigned long RDRFC : 1;
			unsigned long  : 1;
			unsigned long TDREC : 1;
			unsigned long AFERC : 1;
			unsigned long APERC : 1;
			unsigned long MFFC : 1;
			unsigned long  : 1;
			unsigned long ORERC : 1;
			unsigned long  : 5;
			unsigned long DFERC : 1;
			unsigned long DPERC : 1;
			unsigned long DCMFC : 1;
			unsigned long  : 11;
			unsigned long ERSC : 1;
			unsigned long  : 4;
#endif
	} BIT;
	} SSCR;
	union {
		unsigned long LONG;
		struct {
			
